app/Http/Controllers/FuelsController.php

select `id`, `name` from `vehicles`
select `id`, `name` from `fuel_types`
---
    public function index(Request $request)
    {
        $vehicles = Vehicle::select('id','name')->get();
        $fuelTypes = FuelType::select('id','name')->get();

insert into `fuels` (`vehicle_id`, `fuel_type_id`, `refueling`, `volume`, `cost`, `gas_station`, `user_id`, `updated_at`, `created_at`) values ('10', '2', '1981-03-20T12:03', '74', '61', 'Ipsum anim cum at d', 1, '2023-02-10 09:54:13', '2023-02-10 09:54:13')
---
    public function store(Request $request)
    {


        $validation = Validator::make(
            $request->all(),
            Fuel::validation_rules(),
            Fuel::validation_messages(),
        );

        if ($validation->fails()) {
            return $this->respondValidationError($validation->errors());
        }

        $input = $request->all();
        $input['user_id'] = auth()->user()->id;
        $fuel = Fuel::create($input);