app/Http/Controllers/TransportsController.php

select * from `users`
select * from `vehicles`
---
    public function index(Request $request, $format = 'view')
    {
        $users = User::all();
        $vehicles = Vehicle::all();

        $transports = Transport::query();

        if ($with = request('with')) { //load relationships
            $transports->with(explode(',', $with));
        }

        //filter, sorting, selective-columns
        $transports->filter(Transport::parseRequest(request('query')));

        //set default sorting
        if (! Transport::hasSorting(request('query'))) {
            $transports->filter(Transport::getDefaultSorting());
        }

        $transports = $transports->paginateWrap(
            request('items_per_page', self::ITEMS_PER_PAGE),
            request('page', 1)
        );


        if( request()->is('api/*')){
            //an api call
            return $this->respond($transports);
        }else{
            //a web call
            return view('trips.index',['trips'=>$transports,'users'=>$users,'vehicles'=>$vehicles])->with('id',(request()->input('page', 1) - 1) * self::ITEMS_PER_PAGE);