app/Http/Controllers/VehiclesController.php

    public function index(Request $request)
    {

        $vTypes = VehicleType::all();
---
select * from `vehicle_types`

    public function store(Request $request)
    {

        $validation = Validator::make(
            $request->all(),
            Vehicle::validation_rules(),
            Vehicle::validation_messages(),
        );

        if ($validation->fails()) {
            return $this->respondValidationError($validation->errors());
        }
        $input = $request->all();
        $sl_no = "s-" . rand(100000,999999);
        $input['sl_no'] = $sl_no;
        $vehicle = Vehicle::create($input);

        $mileage = new Mileage();
        $mileage->vehicle_id = $vehicle->id;
        $mileage->total_mileage = $request->total_mileage;

        $odoMileage = $mileage->total_mileage;
        $mileage->total_mileage = $odoMileage;
        $vehicle->mileage()->save($mileage);
---
insert into `vehicles` (`sl_no`, `name`, `model`, `tank_capacity`, `license_no`, `vehicle_type_id`, `owner_id`, `updated_at`, `created_at`) values ('Id incididunt quia a', 'Jael Howard', 'Et nisi reiciendis o', '13', 'Labore sed quisquam', '8', 1, '2023-02-10 09:45:58', '2023-02-10 09:45:58')
insert into `mileages` (`vehicle_id`, `total_mileage`, `updated_at`, `created_at`) values (21, '55', '2023-02-10 09:45:58', '2023-02-10 09:45:58')